MikroElektronika/core_packages/PIC/XC8/def/PIC16F18855/mcu.h
// Register: CLKRCLK
#define CLKRCLK CLKRCLK
extern volatile unsigned char           CLKRCLK             __at(0x896);
#ifndef _LIB_BUILD
asm("CLKRCLK equ 0896h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CLKRCLK                :4;
    };
    struct {
        unsigned CLKRCLK0               :1;
        unsigned CLKRCLK1               :1;
        unsigned CLKRCLK2               :1;
        unsigned CLKRCLK3               :1;
    };
} CLKRCLKbits_t;
extern volatile CLKRCLKbits_t CLKRCLKbits __at(0x896);
// bitfield macros
#define _CLKRCLK_CLKRCLK_POSN                               0x0
#define _CLKRCLK_CLKRCLK_POSITION                           0x0
#define _CLKRCLK_CLKRCLK_SIZE                               0x4
#define _CLKRCLK_CLKRCLK_LENGTH                             0x4
#define _CLKRCLK_CLKRCLK_MASK                               0xF
#define _CLKRCLK_CLKRCLK0_POSN                              0x0
#define _CLKRCLK_CLKRCLK0_POSITION                          0x0
#define _CLKRCLK_CLKRCLK0_SIZE                              0x1
#define _CLKRCLK_CLKRCLK0_LENGTH                            0x1
#define _CLKRCLK_CLKRCLK0_MASK                              0x1
#define _CLKRCLK_CLKRCLK1_POSN                              0x1
#define _CLKRCLK_CLKRCLK1_POSITION                          0x1
#define _CLKRCLK_CLKRCLK1_SIZE                              0x1
#define _CLKRCLK_CLKRCLK1_LENGTH                            0x1
#define _CLKRCLK_CLKRCLK1_MASK                              0x2
#define _CLKRCLK_CLKRCLK2_POSN                              0x2
#define _CLKRCLK_CLKRCLK2_POSITION                          0x2
#define _CLKRCLK_CLKRCLK2_SIZE                              0x1
#define _CLKRCLK_CLKRCLK2_LENGTH                            0x1
#define _CLKRCLK_CLKRCLK2_MASK                              0x4
#define _CLKRCLK_CLKRCLK3_POSN                              0x3
#define _CLKRCLK_CLKRCLK3_POSITION                          0x3
#define _CLKRCLK_CLKRCLK3_SIZE                              0x1
#define _CLKRCLK_CLKRCLK3_LENGTH                            0x1
#define _CLKRCLK_CLKRCLK3_MASK                              0x8

// Register: MDCON0
#define MDCON0 MDCON0
extern volatile unsigned char           MDCON0              __at(0x897);
#ifndef _LIB_BUILD
asm("MDCON0 equ 0897h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned MDBIT                  :1;
        unsigned                        :3;
        unsigned MDOPOL                 :1;
        unsigned MDOUT                  :1;
        unsigned                        :1;
        unsigned MDEN                   :1;
    };
} MDCON0bits_t;
extern volatile MDCON0bits_t MDCON0bits __at(0x897);
// bitfield macros
#define _MDCON0_MDBIT_POSN                                  0x0
#define _MDCON0_MDBIT_POSITION                              0x0
#define _MDCON0_MDBIT_SIZE                                  0x1
#define _MDCON0_MDBIT_LENGTH                                0x1
#define _MDCON0_MDBIT_MASK                                  0x1
#define _MDCON0_MDOPOL_POSN                                 0x4
#define _MDCON0_MDOPOL_POSITION                             0x4
#define _MDCON0_MDOPOL_SIZE                                 0x1
#define _MDCON0_MDOPOL_LENGTH                               0x1
#define _MDCON0_MDOPOL_MASK                                 0x10
#define _MDCON0_MDOUT_POSN                                  0x5
#define _MDCON0_MDOUT_POSITION                              0x5
#define _MDCON0_MDOUT_SIZE                                  0x1
#define _MDCON0_MDOUT_LENGTH                                0x1
#define _MDCON0_MDOUT_MASK                                  0x20
#define _MDCON0_MDEN_POSN                                   0x7
#define _MDCON0_MDEN_POSITION                               0x7
#define _MDCON0_MDEN_SIZE                                   0x1
#define _MDCON0_MDEN_LENGTH                                 0x1
#define _MDCON0_MDEN_MASK                                   0x80

// Register: MDCON1
#define MDCON1 MDCON1
extern volatile unsigned char           MDCON1              __at(0x898);
#ifndef _LIB_BUILD
asm("MDCON1 equ 0898h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned MDCLSYNC               :1;
        unsigned MDCLPOL                :1;
        unsigned                        :2;
        unsigned MDCHSYNC               :1;
        unsigned MDCHPOL                :1;
    };
} MDCON1bits_t;
extern volatile MDCON1bits_t MDCON1bits __at(0x898);
// bitfield macros
#define _MDCON1_MDCLSYNC_POSN                               0x0
#define _MDCON1_MDCLSYNC_POSITION                           0x0
#define _MDCON1_MDCLSYNC_SIZE                               0x1
#define _MDCON1_MDCLSYNC_LENGTH                             0x1
#define _MDCON1_MDCLSYNC_MASK                               0x1
#define _MDCON1_MDCLPOL_POSN                                0x1
#define _MDCON1_MDCLPOL_POSITION                            0x1
#define _MDCON1_MDCLPOL_SIZE                                0x1
#define _MDCON1_MDCLPOL_LENGTH                              0x1
#define _MDCON1_MDCLPOL_MASK                                0x2
#define _MDCON1_MDCHSYNC_POSN                               0x4
#define _MDCON1_MDCHSYNC_POSITION                           0x4
#define _MDCON1_MDCHSYNC_SIZE                               0x1
#define _MDCON1_MDCHSYNC_LENGTH                             0x1
#define _MDCON1_MDCHSYNC_MASK                               0x10
#define _MDCON1_MDCHPOL_POSN                                0x5
#define _MDCON1_MDCHPOL_POSITION                            0x5
#define _MDCON1_MDCHPOL_SIZE                                0x1
#define _MDCON1_MDCHPOL_LENGTH                              0x1
#define _MDCON1_MDCHPOL_MASK                                0x20

// Register: MDSRC
#define MDSRC MDSRC
extern volatile unsigned char           MDSRC               __at(0x899);
#ifndef _LIB_BUILD
asm("MDSRC equ 0899h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned MDMS                   :5;
    };
    struct {
        unsigned MDMS0                  :1;
        unsigned MDMS1                  :1;
        unsigned MDMS2                  :1;
        unsigned MDMS3                  :1;
        unsigned MDMS4                  :1;
    };
} MDSRCbits_t;
