MikroElektronika/core_packages/PIC/XC8/def/PIC16F18855/mcu.h
// Register: ZCD1CON
#define ZCD1CON ZCD1CON
extern volatile unsigned char           ZCD1CON             __at(0x91F);
#ifndef _LIB_BUILD
asm("ZCD1CON equ 091Fh");
#endif
// aliases
extern volatile unsigned char           ZCDCON              __at(0x91F);
#ifndef _LIB_BUILD
asm("ZCDCON equ 091Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned INTN                   :1;
        unsigned INTP                   :1;
        unsigned                        :2;
        unsigned POL                    :1;
        unsigned OUT                    :1;
        unsigned                        :1;
        unsigned EN                     :1;
    };
    struct {
        unsigned ZCD1INTN               :1;
        unsigned ZCD1INTP               :1;
        unsigned                        :2;
        unsigned ZCD1POL                :1;
        unsigned ZCD1OUT                :1;
        unsigned                        :1;
        unsigned ZCD1EN                 :1;
    };
    struct {
        unsigned ZCDINTN                :1;
        unsigned ZCDINTP                :1;
        unsigned                        :2;
        unsigned ZCDPOL                 :1;
        unsigned ZCDOUT                 :1;
        unsigned                        :1;
        unsigned ZCDEN                  :1;
    };
} ZCD1CONbits_t;
extern volatile ZCD1CONbits_t ZCD1CONbits __at(0x91F);
// bitfield macros
#define _ZCD1CON_INTN_POSN                                  0x0
#define _ZCD1CON_INTN_POSITION                              0x0
#define _ZCD1CON_INTN_SIZE                                  0x1
#define _ZCD1CON_INTN_LENGTH                                0x1
#define _ZCD1CON_INTN_MASK                                  0x1
#define _ZCD1CON_INTP_POSN                                  0x1
#define _ZCD1CON_INTP_POSITION                              0x1
#define _ZCD1CON_INTP_SIZE                                  0x1
#define _ZCD1CON_INTP_LENGTH                                0x1
#define _ZCD1CON_INTP_MASK                                  0x2
#define _ZCD1CON_POL_POSN                                   0x4
#define _ZCD1CON_POL_POSITION                               0x4
#define _ZCD1CON_POL_SIZE                                   0x1
#define _ZCD1CON_POL_LENGTH                                 0x1
#define _ZCD1CON_POL_MASK                                   0x10
#define _ZCD1CON_OUT_POSN                                   0x5
#define _ZCD1CON_OUT_POSITION                               0x5
#define _ZCD1CON_OUT_SIZE                                   0x1
#define _ZCD1CON_OUT_LENGTH                                 0x1
#define _ZCD1CON_OUT_MASK                                   0x20
#define _ZCD1CON_EN_POSN                                    0x7
#define _ZCD1CON_EN_POSITION                                0x7
#define _ZCD1CON_EN_SIZE                                    0x1
#define _ZCD1CON_EN_LENGTH                                  0x1
#define _ZCD1CON_EN_MASK                                    0x80
#define _ZCD1CON_ZCD1INTN_POSN                              0x0
#define _ZCD1CON_ZCD1INTN_POSITION                          0x0
#define _ZCD1CON_ZCD1INTN_SIZE                              0x1
#define _ZCD1CON_ZCD1INTN_LENGTH                            0x1
#define _ZCD1CON_ZCD1INTN_MASK                              0x1
#define _ZCD1CON_ZCD1INTP_POSN                              0x1
#define _ZCD1CON_ZCD1INTP_POSITION                          0x1
#define _ZCD1CON_ZCD1INTP_SIZE                              0x1
#define _ZCD1CON_ZCD1INTP_LENGTH                            0x1
#define _ZCD1CON_ZCD1INTP_MASK                              0x2
#define _ZCD1CON_ZCD1POL_POSN                               0x4
#define _ZCD1CON_ZCD1POL_POSITION                           0x4
#define _ZCD1CON_ZCD1POL_SIZE                               0x1
#define _ZCD1CON_ZCD1POL_LENGTH                             0x1
#define _ZCD1CON_ZCD1POL_MASK                               0x10
#define _ZCD1CON_ZCD1OUT_POSN                               0x5
#define _ZCD1CON_ZCD1OUT_POSITION                           0x5
#define _ZCD1CON_ZCD1OUT_SIZE                               0x1
#define _ZCD1CON_ZCD1OUT_LENGTH                             0x1
#define _ZCD1CON_ZCD1OUT_MASK                               0x20
#define _ZCD1CON_ZCD1EN_POSN                                0x7
#define _ZCD1CON_ZCD1EN_POSITION                            0x7
#define _ZCD1CON_ZCD1EN_SIZE                                0x1
#define _ZCD1CON_ZCD1EN_LENGTH                              0x1
#define _ZCD1CON_ZCD1EN_MASK                                0x80
#define _ZCD1CON_ZCDINTN_POSN                               0x0
#define _ZCD1CON_ZCDINTN_POSITION                           0x0
#define _ZCD1CON_ZCDINTN_SIZE                               0x1
#define _ZCD1CON_ZCDINTN_LENGTH                             0x1
#define _ZCD1CON_ZCDINTN_MASK                               0x1
#define _ZCD1CON_ZCDINTP_POSN                               0x1
#define _ZCD1CON_ZCDINTP_POSITION                           0x1
#define _ZCD1CON_ZCDINTP_SIZE                               0x1
#define _ZCD1CON_ZCDINTP_LENGTH                             0x1
#define _ZCD1CON_ZCDINTP_MASK                               0x2
#define _ZCD1CON_ZCDPOL_POSN                                0x4
#define _ZCD1CON_ZCDPOL_POSITION                            0x4
#define _ZCD1CON_ZCDPOL_SIZE                                0x1
#define _ZCD1CON_ZCDPOL_LENGTH                              0x1
#define _ZCD1CON_ZCDPOL_MASK                                0x10
#define _ZCD1CON_ZCDOUT_POSN                                0x5
#define _ZCD1CON_ZCDOUT_POSITION                            0x5
#define _ZCD1CON_ZCDOUT_SIZE                                0x1
#define _ZCD1CON_ZCDOUT_LENGTH                              0x1
#define _ZCD1CON_ZCDOUT_MASK                                0x20
#define _ZCD1CON_ZCDEN_POSN                                 0x7
#define _ZCD1CON_ZCDEN_POSITION                             0x7
#define _ZCD1CON_ZCDEN_SIZE                                 0x1
#define _ZCD1CON_ZCDEN_LENGTH                               0x1
#define _ZCD1CON_ZCDEN_MASK                                 0x80
// alias bitfield definitions
typedef union {
    struct {
        unsigned INTN                   :1;
        unsigned INTP                   :1;
        unsigned                        :2;
        unsigned POL                    :1;
        unsigned OUT                    :1;
        unsigned                        :1;
        unsigned EN                     :1;
    };
    struct {
        unsigned ZCD1INTN               :1;
        unsigned ZCD1INTP               :1;
        unsigned                        :2;
        unsigned ZCD1POL                :1;
        unsigned ZCD1OUT                :1;
        unsigned                        :1;
        unsigned ZCD1EN                 :1;
    };
    struct {
        unsigned ZCDINTN                :1;
        unsigned ZCDINTP                :1;
        unsigned                        :2;
        unsigned ZCDPOL                 :1;
        unsigned ZCDOUT                 :1;
        unsigned                        :1;
        unsigned ZCDEN                  :1;
    };
} ZCDCONbits_t;
