MikroElektronika/core_packages/PIC/XC8/def/PIC16F18855/mcu.h
// CLC4SEL2<LC4D3S0>
extern volatile __bit                   LC4D3S0             __at(0x7190);	// @ (0xE32 * 8 + 0)
#define                                 LC4D3S0_bit         _BIT_ACCESS(CLC4SEL2,0)
// CLC4SEL2<LC4D3S1>
extern volatile __bit                   LC4D3S1             __at(0x7191);	// @ (0xE32 * 8 + 1)
#define                                 LC4D3S1_bit         _BIT_ACCESS(CLC4SEL2,1)
// CLC4SEL2<LC4D3S2>
extern volatile __bit                   LC4D3S2             __at(0x7192);	// @ (0xE32 * 8 + 2)
#define                                 LC4D3S2_bit         _BIT_ACCESS(CLC4SEL2,2)
// CLC4SEL2<LC4D3S3>
extern volatile __bit                   LC4D3S3             __at(0x7193);	// @ (0xE32 * 8 + 3)
#define                                 LC4D3S3_bit         _BIT_ACCESS(CLC4SEL2,3)
// CLC4SEL2<LC4D3S4>
extern volatile __bit                   LC4D3S4             __at(0x7194);	// @ (0xE32 * 8 + 4)
#define                                 LC4D3S4_bit         _BIT_ACCESS(CLC4SEL2,4)
// CLC4SEL2<LC4D3S5>
extern volatile __bit                   LC4D3S5             __at(0x7195);	// @ (0xE32 * 8 + 5)
#define                                 LC4D3S5_bit         _BIT_ACCESS(CLC4SEL2,5)
// CLC4SEL2<LC4D3S6>
extern volatile __bit                   LC4D3S6             __at(0x7196);	// @ (0xE32 * 8 + 6)
#define                                 LC4D3S6_bit         _BIT_ACCESS(CLC4SEL2,6)
// CLC4SEL2<LC4D3S7>
extern volatile __bit                   LC4D3S7             __at(0x7197);	// @ (0xE32 * 8 + 7)
#define                                 LC4D3S7_bit         _BIT_ACCESS(CLC4SEL2,7)
// CLC4SEL3<LC4D4S0>
extern volatile __bit                   LC4D4S0             __at(0x7198);	// @ (0xE33 * 8 + 0)
#define                                 LC4D4S0_bit         _BIT_ACCESS(CLC4SEL3,0)
// CLC4SEL3<LC4D4S1>
extern volatile __bit                   LC4D4S1             __at(0x7199);	// @ (0xE33 * 8 + 1)
#define                                 LC4D4S1_bit         _BIT_ACCESS(CLC4SEL3,1)
// CLC4SEL3<LC4D4S2>
extern volatile __bit                   LC4D4S2             __at(0x719A);	// @ (0xE33 * 8 + 2)
#define                                 LC4D4S2_bit         _BIT_ACCESS(CLC4SEL3,2)
// CLC4SEL3<LC4D4S3>
extern volatile __bit                   LC4D4S3             __at(0x719B);	// @ (0xE33 * 8 + 3)
#define                                 LC4D4S3_bit         _BIT_ACCESS(CLC4SEL3,3)
// CLC4SEL3<LC4D4S4>
extern volatile __bit                   LC4D4S4             __at(0x719C);	// @ (0xE33 * 8 + 4)
#define                                 LC4D4S4_bit         _BIT_ACCESS(CLC4SEL3,4)
// CLC4SEL3<LC4D4S5>
extern volatile __bit                   LC4D4S5             __at(0x719D);	// @ (0xE33 * 8 + 5)
#define                                 LC4D4S5_bit         _BIT_ACCESS(CLC4SEL3,5)
// CLC4SEL3<LC4D4S6>
extern volatile __bit                   LC4D4S6             __at(0x719E);	// @ (0xE33 * 8 + 6)
#define                                 LC4D4S6_bit         _BIT_ACCESS(CLC4SEL3,6)
// CLC4SEL3<LC4D4S7>
extern volatile __bit                   LC4D4S7             __at(0x719F);	// @ (0xE33 * 8 + 7)
#define                                 LC4D4S7_bit         _BIT_ACCESS(CLC4SEL3,7)
// CLC4CON<LC4EN>
extern volatile __bit                   LC4EN               __at(0x7177);	// @ (0xE2E * 8 + 7)
#define                                 LC4EN_bit           _BIT_ACCESS(CLC4CON,7)
// CLC4GLS0<LC4G1D1N>
extern volatile __bit                   LC4G1D1N            __at(0x71A0);	// @ (0xE34 * 8 + 0)
#define                                 LC4G1D1N_bit        _BIT_ACCESS(CLC4GLS0,0)
// CLC4GLS0<LC4G1D1T>
extern volatile __bit                   LC4G1D1T            __at(0x71A1);	// @ (0xE34 * 8 + 1)
#define                                 LC4G1D1T_bit        _BIT_ACCESS(CLC4GLS0,1)
// CLC4GLS0<LC4G1D2N>
extern volatile __bit                   LC4G1D2N            __at(0x71A2);	// @ (0xE34 * 8 + 2)
#define                                 LC4G1D2N_bit        _BIT_ACCESS(CLC4GLS0,2)
// CLC4GLS0<LC4G1D2T>
extern volatile __bit                   LC4G1D2T            __at(0x71A3);	// @ (0xE34 * 8 + 3)
#define                                 LC4G1D2T_bit        _BIT_ACCESS(CLC4GLS0,3)
// CLC4GLS0<LC4G1D3N>
extern volatile __bit                   LC4G1D3N            __at(0x71A4);	// @ (0xE34 * 8 + 4)
#define                                 LC4G1D3N_bit        _BIT_ACCESS(CLC4GLS0,4)
// CLC4GLS0<LC4G1D3T>
extern volatile __bit                   LC4G1D3T            __at(0x71A5);	// @ (0xE34 * 8 + 5)
#define                                 LC4G1D3T_bit        _BIT_ACCESS(CLC4GLS0,5)
// CLC4GLS0<LC4G1D4N>
extern volatile __bit                   LC4G1D4N            __at(0x71A6);	// @ (0xE34 * 8 + 6)
#define                                 LC4G1D4N_bit        _BIT_ACCESS(CLC4GLS0,6)
// CLC4GLS0<LC4G1D4T>
extern volatile __bit                   LC4G1D4T            __at(0x71A7);	// @ (0xE34 * 8 + 7)
#define                                 LC4G1D4T_bit        _BIT_ACCESS(CLC4GLS0,7)
// CLC4POL<LC4G1POL>
extern volatile __bit                   LC4G1POL            __at(0x7178);	// @ (0xE2F * 8 + 0)
#define                                 LC4G1POL_bit        _BIT_ACCESS(CLC4POL,0)
// CLC4GLS1<LC4G2D1N>
extern volatile __bit                   LC4G2D1N            __at(0x71A8);	// @ (0xE35 * 8 + 0)
#define                                 LC4G2D1N_bit        _BIT_ACCESS(CLC4GLS1,0)
// CLC4GLS1<LC4G2D1T>
extern volatile __bit                   LC4G2D1T            __at(0x71A9);	// @ (0xE35 * 8 + 1)
#define                                 LC4G2D1T_bit        _BIT_ACCESS(CLC4GLS1,1)
// CLC4GLS1<LC4G2D2N>
extern volatile __bit                   LC4G2D2N            __at(0x71AA);	// @ (0xE35 * 8 + 2)
#define                                 LC4G2D2N_bit        _BIT_ACCESS(CLC4GLS1,2)
// CLC4GLS1<LC4G2D2T>
extern volatile __bit                   LC4G2D2T            __at(0x71AB);	// @ (0xE35 * 8 + 3)
#define                                 LC4G2D2T_bit        _BIT_ACCESS(CLC4GLS1,3)
// CLC4GLS1<LC4G2D3N>
extern volatile __bit                   LC4G2D3N            __at(0x71AC);	// @ (0xE35 * 8 + 4)
#define                                 LC4G2D3N_bit        _BIT_ACCESS(CLC4GLS1,4)
// CLC4GLS1<LC4G2D3T>
extern volatile __bit                   LC4G2D3T            __at(0x71AD);	// @ (0xE35 * 8 + 5)
#define                                 LC4G2D3T_bit        _BIT_ACCESS(CLC4GLS1,5)
// CLC4GLS1<LC4G2D4N>
extern volatile __bit                   LC4G2D4N            __at(0x71AE);	// @ (0xE35 * 8 + 6)
#define                                 LC4G2D4N_bit        _BIT_ACCESS(CLC4GLS1,6)
// CLC4GLS1<LC4G2D4T>
extern volatile __bit                   LC4G2D4T            __at(0x71AF);	// @ (0xE35 * 8 + 7)
#define                                 LC4G2D4T_bit        _BIT_ACCESS(CLC4GLS1,7)
// CLC4POL<LC4G2POL>
extern volatile __bit                   LC4G2POL            __at(0x7179);	// @ (0xE2F * 8 + 1)
#define                                 LC4G2POL_bit        _BIT_ACCESS(CLC4POL,1)
// CLC4GLS2<LC4G3D1N>
extern volatile __bit                   LC4G3D1N            __at(0x71B0);	// @ (0xE36 * 8 + 0)
#define                                 LC4G3D1N_bit        _BIT_ACCESS(CLC4GLS2,0)
// CLC4GLS2<LC4G3D1T>
extern volatile __bit                   LC4G3D1T            __at(0x71B1);	// @ (0xE36 * 8 + 1)
#define                                 LC4G3D1T_bit        _BIT_ACCESS(CLC4GLS2,1)
// CLC4GLS2<LC4G3D2N>
extern volatile __bit                   LC4G3D2N            __at(0x71B2);	// @ (0xE36 * 8 + 2)
#define                                 LC4G3D2N_bit        _BIT_ACCESS(CLC4GLS2,2)
// CLC4GLS2<LC4G3D2T>
extern volatile __bit                   LC4G3D2T            __at(0x71B3);	// @ (0xE36 * 8 + 3)
#define                                 LC4G3D2T_bit        _BIT_ACCESS(CLC4GLS2,3)
// CLC4GLS2<LC4G3D3N>
extern volatile __bit                   LC4G3D3N            __at(0x71B4);	// @ (0xE36 * 8 + 4)
#define                                 LC4G3D3N_bit        _BIT_ACCESS(CLC4GLS2,4)
// CLC4GLS2<LC4G3D3T>
extern volatile __bit                   LC4G3D3T            __at(0x71B5);	// @ (0xE36 * 8 + 5)
#define                                 LC4G3D3T_bit        _BIT_ACCESS(CLC4GLS2,5)
// CLC4GLS2<LC4G3D4N>
extern volatile __bit                   LC4G3D4N            __at(0x71B6);	// @ (0xE36 * 8 + 6)
#define                                 LC4G3D4N_bit        _BIT_ACCESS(CLC4GLS2,6)
// CLC4GLS2<LC4G3D4T>
extern volatile __bit                   LC4G3D4T            __at(0x71B7);	// @ (0xE36 * 8 + 7)
#define                                 LC4G3D4T_bit        _BIT_ACCESS(CLC4GLS2,7)
// CLC4POL<LC4G3POL>
extern volatile __bit                   LC4G3POL            __at(0x717A);	// @ (0xE2F * 8 + 2)
#define                                 LC4G3POL_bit        _BIT_ACCESS(CLC4POL,2)
// CLC4GLS3<LC4G4D1N>
extern volatile __bit                   LC4G4D1N            __at(0x71B8);	// @ (0xE37 * 8 + 0)
#define                                 LC4G4D1N_bit        _BIT_ACCESS(CLC4GLS3,0)
// CLC4GLS3<LC4G4D1T>
extern volatile __bit                   LC4G4D1T            __at(0x71B9);	// @ (0xE37 * 8 + 1)
#define                                 LC4G4D1T_bit        _BIT_ACCESS(CLC4GLS3,1)
// CLC4GLS3<LC4G4D2N>
extern volatile __bit                   LC4G4D2N            __at(0x71BA);	// @ (0xE37 * 8 + 2)
#define                                 LC4G4D2N_bit        _BIT_ACCESS(CLC4GLS3,2)
// CLC4GLS3<LC4G4D2T>
extern volatile __bit                   LC4G4D2T            __at(0x71BB);	// @ (0xE37 * 8 + 3)
#define                                 LC4G4D2T_bit        _BIT_ACCESS(CLC4GLS3,3)
// CLC4GLS3<LC4G4D3N>
extern volatile __bit                   LC4G4D3N            __at(0x71BC);	// @ (0xE37 * 8 + 4)
#define                                 LC4G4D3N_bit        _BIT_ACCESS(CLC4GLS3,4)
// CLC4GLS3<LC4G4D3T>
extern volatile __bit                   LC4G4D3T            __at(0x71BD);	// @ (0xE37 * 8 + 5)
#define                                 LC4G4D3T_bit        _BIT_ACCESS(CLC4GLS3,5)
// CLC4GLS3<LC4G4D4N>
extern volatile __bit                   LC4G4D4N            __at(0x71BE);	// @ (0xE37 * 8 + 6)
#define                                 LC4G4D4N_bit        _BIT_ACCESS(CLC4GLS3,6)
// CLC4GLS3<LC4G4D4T>
extern volatile __bit                   LC4G4D4T            __at(0x71BF);	// @ (0xE37 * 8 + 7)
#define                                 LC4G4D4T_bit        _BIT_ACCESS(CLC4GLS3,7)
// CLC4POL<LC4G4POL>
extern volatile __bit                   LC4G4POL            __at(0x717B);	// @ (0xE2F * 8 + 3)
#define                                 LC4G4POL_bit        _BIT_ACCESS(CLC4POL,3)
// CLC4CON<LC4INTN>
extern volatile __bit                   LC4INTN             __at(0x7173);	// @ (0xE2E * 8 + 3)
#define                                 LC4INTN_bit         _BIT_ACCESS(CLC4CON,3)
// CLC4CON<LC4INTP>
extern volatile __bit                   LC4INTP             __at(0x7174);	// @ (0xE2E * 8 + 4)
#define                                 LC4INTP_bit         _BIT_ACCESS(CLC4CON,4)
// CLC4CON<LC4MODE0>
extern volatile __bit                   LC4MODE0            __at(0x7170);	// @ (0xE2E * 8 + 0)
#define                                 LC4MODE0_bit        _BIT_ACCESS(CLC4CON,0)
// CLC4CON<LC4MODE1>
extern volatile __bit                   LC4MODE1            __at(0x7171);	// @ (0xE2E * 8 + 1)
#define                                 LC4MODE1_bit        _BIT_ACCESS(CLC4CON,1)
// CLC4CON<LC4MODE2>
extern volatile __bit                   LC4MODE2            __at(0x7172);	// @ (0xE2E * 8 + 2)
#define                                 LC4MODE2_bit        _BIT_ACCESS(CLC4CON,2)
// CLC4CON<LC4OUT>
extern volatile __bit                   LC4OUT              __at(0x7175);	// @ (0xE2E * 8 + 5)
#define                                 LC4OUT_bit          _BIT_ACCESS(CLC4CON,5)
// CLC4POL<LC4POL>
extern volatile __bit                   LC4POL              __at(0x717F);	// @ (0xE2F * 8 + 7)
#define                                 LC4POL_bit          _BIT_ACCESS(CLC4POL,7)
// OSCEN<LFOEN>
extern volatile __bit                   LFOEN               __at(0x448C);	// @ (0x891 * 8 + 4)
#define                                 LFOEN_bit           _BIT_ACCESS(OSCEN,4)
// OSCSTAT<LFOR>
extern volatile __bit                   LFOR                __at(0x4484);	// @ (0x890 * 8 + 4)
#define                                 LFOR_bit            _BIT_ACCESS(OSCSTAT,4)
// NVMCON1<LWLO>
extern volatile __bit                   LWLO                __at(0x40F5);	// @ (0x81E * 8 + 5)
#define                                 LWLO_bit            _BIT_ACCESS(NVMCON1,5)
// CMOUT<MC1OUT>
extern volatile __bit                   MC1OUT              __at(0x4C78);	// @ (0x98F * 8 + 0)
#define                                 MC1OUT_bit          _BIT_ACCESS(CMOUT,0)
// CMOUT<MC2OUT>
extern volatile __bit                   MC2OUT              __at(0x4C79);	// @ (0x98F * 8 + 1)
#define                                 MC2OUT_bit          _BIT_ACCESS(CMOUT,1)
// MDCON0<MDBIT>
extern volatile __bit                   MDBIT               __at(0x44B8);	// @ (0x897 * 8 + 0)
#define                                 MDBIT_bit           _BIT_ACCESS(MDCON0,0)
// MDCARHPPS<MDCARHPPS0>
extern volatile __bit                   MDCARHPPS0          __at(0x75C8);	// @ (0xEB9 * 8 + 0)
#define                                 MDCARHPPS0_bit      _BIT_ACCESS(MDCARHPPS,0)
// MDCARHPPS<MDCARHPPS1>
extern volatile __bit                   MDCARHPPS1          __at(0x75C9);	// @ (0xEB9 * 8 + 1)
#define                                 MDCARHPPS1_bit      _BIT_ACCESS(MDCARHPPS,1)
// MDCARHPPS<MDCARHPPS2>
extern volatile __bit                   MDCARHPPS2          __at(0x75CA);	// @ (0xEB9 * 8 + 2)
#define                                 MDCARHPPS2_bit      _BIT_ACCESS(MDCARHPPS,2)
// MDCARHPPS<MDCARHPPS3>
extern volatile __bit                   MDCARHPPS3          __at(0x75CB);	// @ (0xEB9 * 8 + 3)
#define                                 MDCARHPPS3_bit      _BIT_ACCESS(MDCARHPPS,3)
// MDCARHPPS<MDCARHPPS4>
extern volatile __bit                   MDCARHPPS4          __at(0x75CC);	// @ (0xEB9 * 8 + 4)
#define                                 MDCARHPPS4_bit      _BIT_ACCESS(MDCARHPPS,4)
// MDCARLPPS<MDCARLPPS0>
extern volatile __bit                   MDCARLPPS0          __at(0x75C0);	// @ (0xEB8 * 8 + 0)
#define                                 MDCARLPPS0_bit      _BIT_ACCESS(MDCARLPPS,0)
// MDCARLPPS<MDCARLPPS1>
extern volatile __bit                   MDCARLPPS1          __at(0x75C1);	// @ (0xEB8 * 8 + 1)
#define                                 MDCARLPPS1_bit      _BIT_ACCESS(MDCARLPPS,1)
// MDCARLPPS<MDCARLPPS2>
extern volatile __bit                   MDCARLPPS2          __at(0x75C2);	// @ (0xEB8 * 8 + 2)
#define                                 MDCARLPPS2_bit      _BIT_ACCESS(MDCARLPPS,2)
// MDCARLPPS<MDCARLPPS3>
extern volatile __bit                   MDCARLPPS3          __at(0x75C3);	// @ (0xEB8 * 8 + 3)
#define                                 MDCARLPPS3_bit      _BIT_ACCESS(MDCARLPPS,3)
// MDCARLPPS<MDCARLPPS4>
extern volatile __bit                   MDCARLPPS4          __at(0x75C4);	// @ (0xEB8 * 8 + 4)
#define                                 MDCARLPPS4_bit      _BIT_ACCESS(MDCARLPPS,4)
// MDCARH<MDCH0>
extern volatile __bit                   MDCH0               __at(0x44D8);	// @ (0x89B * 8 + 0)
#define                                 MDCH0_bit           _BIT_ACCESS(MDCARH,0)
// MDCARH<MDCH1>
extern volatile __bit                   MDCH1               __at(0x44D9);	// @ (0x89B * 8 + 1)
#define                                 MDCH1_bit           _BIT_ACCESS(MDCARH,1)
// MDCARH<MDCH2>
extern volatile __bit                   MDCH2               __at(0x44DA);	// @ (0x89B * 8 + 2)
#define                                 MDCH2_bit           _BIT_ACCESS(MDCARH,2)
// MDCARH<MDCH3>
extern volatile __bit                   MDCH3               __at(0x44DB);	// @ (0x89B * 8 + 3)
#define                                 MDCH3_bit           _BIT_ACCESS(MDCARH,3)
// MDCON1<MDCHPOL>
extern volatile __bit                   MDCHPOL             __at(0x44C5);	// @ (0x898 * 8 + 5)
#define                                 MDCHPOL_bit         _BIT_ACCESS(MDCON1,5)
// MDCON1<MDCHSYNC>
extern volatile __bit                   MDCHSYNC            __at(0x44C4);	// @ (0x898 * 8 + 4)
#define                                 MDCHSYNC_bit        _BIT_ACCESS(MDCON1,4)
// MDCARL<MDCL0>
extern volatile __bit                   MDCL0               __at(0x44D0);	// @ (0x89A * 8 + 0)
#define                                 MDCL0_bit           _BIT_ACCESS(MDCARL,0)
// MDCARL<MDCL1>
extern volatile __bit                   MDCL1               __at(0x44D1);	// @ (0x89A * 8 + 1)
#define                                 MDCL1_bit           _BIT_ACCESS(MDCARL,1)
// MDCARL<MDCL2>
extern volatile __bit                   MDCL2               __at(0x44D2);	// @ (0x89A * 8 + 2)
#define                                 MDCL2_bit           _BIT_ACCESS(MDCARL,2)
// MDCARL<MDCL3>
extern volatile __bit                   MDCL3               __at(0x44D3);	// @ (0x89A * 8 + 3)
#define                                 MDCL3_bit           _BIT_ACCESS(MDCARL,3)
// MDCON1<MDCLPOL>
extern volatile __bit                   MDCLPOL             __at(0x44C1);	// @ (0x898 * 8 + 1)
#define                                 MDCLPOL_bit         _BIT_ACCESS(MDCON1,1)
// MDCON1<MDCLSYNC>
extern volatile __bit                   MDCLSYNC            __at(0x44C0);	// @ (0x898 * 8 + 0)
#define                                 MDCLSYNC_bit        _BIT_ACCESS(MDCON1,0)
// MDCON0<MDEN>
extern volatile __bit                   MDEN                __at(0x44BF);	// @ (0x897 * 8 + 7)
#define                                 MDEN_bit            _BIT_ACCESS(MDCON0,7)
// MDSRC<MDMS0>
extern volatile __bit                   MDMS0               __at(0x44C8);	// @ (0x899 * 8 + 0)
#define                                 MDMS0_bit           _BIT_ACCESS(MDSRC,0)
// MDSRC<MDMS1>
extern volatile __bit                   MDMS1               __at(0x44C9);	// @ (0x899 * 8 + 1)
#define                                 MDMS1_bit           _BIT_ACCESS(MDSRC,1)
// MDSRC<MDMS2>
extern volatile __bit                   MDMS2               __at(0x44CA);	// @ (0x899 * 8 + 2)
#define                                 MDMS2_bit           _BIT_ACCESS(MDSRC,2)
// MDSRC<MDMS3>
extern volatile __bit                   MDMS3               __at(0x44CB);	// @ (0x899 * 8 + 3)
#define                                 MDMS3_bit           _BIT_ACCESS(MDSRC,3)
// MDSRC<MDMS4>
extern volatile __bit                   MDMS4               __at(0x44CC);	// @ (0x899 * 8 + 4)
#define                                 MDMS4_bit           _BIT_ACCESS(MDSRC,4)
// MDCON0<MDOPOL>
extern volatile __bit                   MDOPOL              __at(0x44BC);	// @ (0x897 * 8 + 4)
#define                                 MDOPOL_bit          _BIT_ACCESS(MDCON0,4)
// MDCON0<MDOUT>
extern volatile __bit                   MDOUT               __at(0x44BD);	// @ (0x897 * 8 + 5)
#define                                 MDOUT_bit           _BIT_ACCESS(MDCON0,5)
// MDSRCPPS<MDSRCPPS0>
extern volatile __bit                   MDSRCPPS0           __at(0x75D0);	// @ (0xEBA * 8 + 0)
#define                                 MDSRCPPS0_bit       _BIT_ACCESS(MDSRCPPS,0)
// MDSRCPPS<MDSRCPPS1>
extern volatile __bit                   MDSRCPPS1           __at(0x75D1);	// @ (0xEBA * 8 + 1)
#define                                 MDSRCPPS1_bit       _BIT_ACCESS(MDSRCPPS,1)
// MDSRCPPS<MDSRCPPS2>
extern volatile __bit                   MDSRCPPS2           __at(0x75D2);	// @ (0xEBA * 8 + 2)
#define                                 MDSRCPPS2_bit       _BIT_ACCESS(MDSRCPPS,2)
// MDSRCPPS<MDSRCPPS3>
extern volatile __bit                   MDSRCPPS3           __at(0x75D3);	// @ (0xEBA * 8 + 3)
#define                                 MDSRCPPS3_bit       _BIT_ACCESS(MDSRCPPS,3)
// MDSRCPPS<MDSRCPPS4>
extern volatile __bit                   MDSRCPPS4           __at(0x75D4);	// @ (0xEBA * 8 + 4)
#define                                 MDSRCPPS4_bit       _BIT_ACCESS(MDSRCPPS,4)
// OSCEN<MFOEN>
extern volatile __bit                   MFOEN               __at(0x448D);	// @ (0x891 * 8 + 5)
#define                                 MFOEN_bit           _BIT_ACCESS(OSCEN,5)
// OSCSTAT<MFOR>
extern volatile __bit                   MFOR                __at(0x4485);	// @ (0x890 * 8 + 5)
#define                                 MFOR_bit            _BIT_ACCESS(OSCSTAT,5)
// CLCDATA<MLC1OUT>
extern volatile __bit                   MLC1OUT             __at(0x7078);	// @ (0xE0F * 8 + 0)
#define                                 MLC1OUT_bit         _BIT_ACCESS(CLCDATA,0)
// CLCDATA<MLC2OUT>
extern volatile __bit                   MLC2OUT             __at(0x7079);	// @ (0xE0F * 8 + 1)
#define                                 MLC2OUT_bit         _BIT_ACCESS(CLCDATA,1)
// CLCDATA<MLC3OUT>
extern volatile __bit                   MLC3OUT             __at(0x707A);	// @ (0xE0F * 8 + 2)
#define                                 MLC3OUT_bit         _BIT_ACCESS(CLCDATA,2)
// CLCDATA<MLC4OUT>
extern volatile __bit                   MLC4OUT             __at(0x707B);	// @ (0xE0F * 8 + 3)
#define                                 MLC4OUT_bit         _BIT_ACCESS(CLCDATA,3)
// SSP1ADD<MSK01>
extern volatile __bit                   MSK01               __at(0xC68);	// @ (0x18D * 8 + 0)
#define                                 MSK01_bit           _BIT_ACCESS(SSP1ADD,0)
// SSP2ADD<MSK02>
extern volatile __bit                   MSK02               __at(0xCB8);	// @ (0x197 * 8 + 0)
#define                                 MSK02_bit           _BIT_ACCESS(SSP2ADD,0)
// SSP1ADD<MSK11>
extern volatile __bit                   MSK11               __at(0xC69);	// @ (0x18D * 8 + 1)
#define                                 MSK11_bit           _BIT_ACCESS(SSP1ADD,1)
// SSP2ADD<MSK12>
extern volatile __bit                   MSK12               __at(0xCB9);	// @ (0x197 * 8 + 1)
#define                                 MSK12_bit           _BIT_ACCESS(SSP2ADD,1)
// SSP1ADD<MSK21>
extern volatile __bit                   MSK21               __at(0xC6A);	// @ (0x18D * 8 + 2)
#define                                 MSK21_bit           _BIT_ACCESS(SSP1ADD,2)
// SSP2ADD<MSK22>
extern volatile __bit                   MSK22               __at(0xCBA);	// @ (0x197 * 8 + 2)
#define                                 MSK22_bit           _BIT_ACCESS(SSP2ADD,2)
// SSP1ADD<MSK31>
extern volatile __bit                   MSK31               __at(0xC6B);	// @ (0x18D * 8 + 3)
#define                                 MSK31_bit           _BIT_ACCESS(SSP1ADD,3)
// SSP2ADD<MSK32>
extern volatile __bit                   MSK32               __at(0xCBB);	// @ (0x197 * 8 + 3)
#define                                 MSK32_bit           _BIT_ACCESS(SSP2ADD,3)
// SSP1ADD<MSK41>
extern volatile __bit                   MSK41               __at(0xC6C);	// @ (0x18D * 8 + 4)
#define                                 MSK41_bit           _BIT_ACCESS(SSP1ADD,4)
// SSP2ADD<MSK42>
extern volatile __bit                   MSK42               __at(0xCBC);	// @ (0x197 * 8 + 4)
#define                                 MSK42_bit           _BIT_ACCESS(SSP2ADD,4)
// SSP1ADD<MSK51>
extern volatile __bit                   MSK51               __at(0xC6D);	// @ (0x18D * 8 + 5)
#define                                 MSK51_bit           _BIT_ACCESS(SSP1ADD,5)
// SSP2ADD<MSK52>
extern volatile __bit                   MSK52               __at(0xCBD);	// @ (0x197 * 8 + 5)
#define                                 MSK52_bit           _BIT_ACCESS(SSP2ADD,5)
// SSP1ADD<MSK61>
extern volatile __bit                   MSK61               __at(0xC6E);	// @ (0x18D * 8 + 6)
#define                                 MSK61_bit           _BIT_ACCESS(SSP1ADD,6)
// SSP2ADD<MSK62>
extern volatile __bit                   MSK62               __at(0xCBE);	// @ (0x197 * 8 + 6)
